{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "EfficientNet",
    "parent_library": "torchvision.models.efficientnet"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "qalora_group_size": 16,
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "classifier.1",
    "block.3.0",
    "2.0.block.0.0",
    "4.0.block.0.0",
    "3.0.block.0.0",
    "2.block.0.0",
    "6.0.block.0.0",
    "5.0.block.0.0",
    "8.0",
    "1.block.0.0",
    "3.block.0.0",
    "block.2.0",
    "fc2",
    "features.0.0",
    "7.0.block.0.0",
    "fc1"
  ],
  "target_parameters": null,
  "task_type": null,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}